// @strict-types

//
#Область ПрограммныйИнтерфейс

// Сценарий теста.
// 
// Параметры:
//  Индекс - Число - Индекс итерации теста
//  СИсключительнойСитуацией - Булево - Признак того, что сценарий должен выполниться с исключительной ситуацией
// 
// Возвращаемое значение:
//  Число - результат выполнения
Функция СценарийТеста(Индекс, СИсключительнойСитуацией) Экспорт

	Результат = 0;

	Если СИсключительнойСитуацией Тогда
		ВызватьИсключение "Тест 3 (Вызов исключения как оператора)";
	КонецЕсли;

	Возврат Результат;
КонецФункции

// Полезная нагрузка для обработки исключительной ситуации.
// 
// Возвращаемое значение:
//  Число - Полезная нагрузка
Функция ПолезнаяНагрузка() Экспорт

	ПолезнаяНагрузка = 1 * 2;

	Возврат ПолезнаяНагрузка;
КонецФункции

#КонецОбласти