// @strict-types

//
#Область ПрограммныйИнтерфейс

// Исключительная ситуация.
// 
// Параметры:
//  Индекс - Число - Индекс итерации теста
// 
// Возвращаемое значение:
//  Число - результат выполнения
Функция ИсключительнаяСитуация(Индекс) Экспорт

	Результат = Истина;

	ВызватьИсключение "Тест 3 (Вызов исключения как оператора)";

	//@skip-check bsl-legacy-check-method-for-statements-after-return
	Возврат Результат;
КонецФункции

// Полезная нагрузка для обработки исключительной ситуации.
// 
// Возвращаемое значение:
//  Число - Полезная нагрузка
Функция ПолезнаяНагрузка() Экспорт

	ПолезнаяНагрузка = 1 * 2;

	Возврат ПолезнаяНагрузка;
КонецФункции

// Проверка наличия исключительной ситуации в тесте
// 
// Параметры:
//  Индекс - Число - Индекс итерации теста
// 
// Возвращаемое значение:
//  Булево - Есть исключительная ситуация
Функция ЕстьИсключительнаяСитуация(Индекс) Экспорт

	ЕстьИсключительнаяСитуация = Истина;

	Возврат ЕстьИсключительнаяСитуация;
КонецФункции

#КонецОбласти
