// @strict-types

//
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда_Тест1(Команда)
	Команда_Тест1НаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Команда_Тест2(Команда)
	Команда_Тест2НаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура Команда_Тест1НаСервере()

	НаименованиеТеста = "Деление на ноль";
	КоличествоПовторенийТеста = 10;
	ТаблицаРезультатов = PEN012_Тесты.Тест(НаименованиеТеста, КоличествоПовторенийТеста);
	ВывестиДиаграмму(ТаблицаРезультатов, НаименованиеТеста);

КонецПроцедуры

&НаСервере
Процедура Команда_Тест2НаСервере()

	НаименованиеТеста = "Выход за границу массива";
	КоличествоПовторенийТеста = 10;
	ТаблицаРезультатов = PEN012_Тесты.Тест(НаименованиеТеста, КоличествоПовторенийТеста);
	ВывестиДиаграмму(ТаблицаРезультатов, НаименованиеТеста);

КонецПроцедуры

&НаСервере
Процедура ВывестиДиаграмму(ТаблицаРезультатов, НаименованиеТеста)

	Диаграмма.Очистить();
	Диаграмма.ОбластьЗаголовка.Текст = НаименованиеТеста;
	Диаграмма.ОбластьЗаголовка.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;

	Для Каждого Элемент Из ТаблицаРезультатов Цикл
		Серия = Диаграмма.УстановитьСерию("Без исключения");
		Точка = Диаграмма.УстановитьТочку(Элемент.Итерация);
		Диаграмма.УстановитьЗначение(Точка, Серия, Элемент.ДлительностьБезИсключения);

		Серия = Диаграмма.УстановитьСерию("С исключением");
		Точка = Диаграмма.УстановитьТочку(Элемент.Итерация);
		Диаграмма.УстановитьЗначение(Точка, Серия, Элемент.ДлительностьСИсключением);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти